app/controllers/chats_controller.rb

  def create
    user=User.find_by_id(params[:users])
    current_user.chats.each do |chat|
      if (chat.users-[user, current_user]).blank?
        redirect_to chat_path(chat) and return
      end
    end

    @chat = Chat.new
    @chat.users<<user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" INNER JOIN "chats_users" ON "chats"."id" = "chats_users"."chat_id" WHERE "chats_users"."user_id" = ?  [["user_id", 1]]
INSERT INTO "chats" ("name", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "user2-user1"], ["admin_id", 1], ["created_at", "2018-04-02 03:18:39.480146"], ["updated_at", "2018-04-02 03:18:39.480146"]]

  def set_device
    @device=Device.find_by_id(params[:id])
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 4 LIMIT 1