app/controllers/messages_controller.rb

  def create
    @message=@device.messages.build(message_params)
    device=Device.find_by_id(params[:deviceid])
    redirect_to chats_path, flash: {:warning => '此聊天不存在'} and return if device.nil?
    @message.device = device
    @message.from_whom = 0
    @message.whom_id = @device_status.user_id
    if @message.save
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 4 LIMIT 1
INSERT INTO "messages" ("body", "user_id", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "ninhao \\"], ["user_id", 1], ["chat_id", 1], ["created_at", "2018-04-02 03:18:44.931436"], ["updated_at", "2018-04-02 03:18:44.931436"]]